; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation9 - direction
	Star0 - direction
	GroundStation8 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star7)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(have_image Star10 thermograph2)
	(have_image Planet11 image0)
	(have_image Star12 image0)
	(have_image Planet13 thermograph2)
	(have_image Star14 thermograph2)
	(have_image Star15 infrared1)
	(have_image Planet16 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 star12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star12)
   goals met: 0 of 7
4. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 1 of 7
5. (turn_to satellite0 planet16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet16)
   goals met: 1 of 7
6. (take_image satellite0 planet16 instrument0 image0)
   added: (have_image planet16 image0)
   goals met: 2 of 7
7. (turn_to satellite0 planet11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
8. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 3 of 7
9. (turn_to satellite0 groundstation1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 7
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 7
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 7
12. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 7
13. (turn_to satellite0 planet13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet13)
   goals met: 3 of 7
14. (take_image satellite0 planet13 instrument2 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 4 of 7
15. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
16. (take_image satellite0 star10 instrument2 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 5 of 7
17. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 5 of 7
18. (take_image satellite0 star14 instrument2 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 6 of 7
19. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 7
20. (take_image satellite0 star15 instrument2 infrared1)
   added: (have_image star15 infrared1)
   goals met: 7 of 7
